================================================================================
Simple command
================================================================================

echo hello

--------------------------------------------------------------------------------

(program
  (command
    name: (command_name
      (word))
    argument: (word)))

================================================================================
Pipeline
================================================================================

cat file | grep pattern

--------------------------------------------------------------------------------

(program
  (pipeline
    (command
      name: (command_name
        (word))
      argument: (word))
    (command
      name: (command_name
        (word))
      argument: (word))))

================================================================================
Variable assignment
================================================================================

var=value

--------------------------------------------------------------------------------

(program
  (variable_assignment
    name: (variable_name)
    value: (word)))

================================================================================
If statement
================================================================================

if true; then echo yes; fi

--------------------------------------------------------------------------------

(program
  (if_statement
    condition: (command
      name: (command_name
        (word)))
    (command
      name: (command_name
        (word))
      argument: (word))))

================================================================================
For loop
================================================================================

for i in 1 2 3; do echo $i; done

--------------------------------------------------------------------------------

(program
  (for_statement
    variable: (simple_variable_name)
    value: (number)
    value: (number)
    value: (number)
    body: (do_group
      (command
        name: (command_name
          (word))
        argument: (variable_ref
          (simple_variable_name))))))

================================================================================
Function definition
================================================================================

func() { echo test; }

--------------------------------------------------------------------------------

(program
  (function_definition
    name: (word)
    body: (compound_statement
      (command
        name: (command_name
          (word))
        argument: (word)))))
