================================================================================
Anonymous function
================================================================================

() { echo "test"; }

--------------------------------------------------------------------------------

(program
  (function_definition
    body: (compound_statement
      (command
        name: (command_name
          (word))
        argument: (string
          (string_content))))))

================================================================================
Type declaration - integer
================================================================================

integer count=42

--------------------------------------------------------------------------------

(program
  (declaration_command
    (variable_assignment
      (variable_name)
      (number))))

================================================================================
Type declaration - float
================================================================================

float pi=3.14

--------------------------------------------------------------------------------

(program
  (declaration_command
    (variable_assignment
      (variable_name)
      (word))))

================================================================================
Repeat statement
================================================================================

repeat 3 echo test

--------------------------------------------------------------------------------

(program
  (repeat_statement
    count: (number)
    (command
      name: (command_name
        (word))
      argument: (word))))

================================================================================
Zsh Function definition
================================================================================

function func() {
    echo ${test}
}

--------------------------------------------------------------------------------

(program
  (function_definition
    (word)
    (compound_statement
      (command
        (command_name
          (word))
        (expansion
          (simple_variable_name))))))
